src/Catalogs/ИТ_НастройкиДописанногоФункционала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИТ_НастройкиДописанногоФункционала</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТипаЦен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонка1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИТ_РегламентныеПроцедуры/Ext/Module.bsl
//Перем РабочееСоединение;
//Перем ТекущееСоединение;

&НаСервере
Функция РабочаяБаза() Экспорт
	РабочееСоединение = Нрег(Справочники.ИТ_НастройкиДописанногоФункционала.СтрокаСоединенияИнформационнойБазыДляРегламентыхЗаданий.Значение);
	ТекущееСоединение = Нрег(СтрокаСоединенияИнформационнойБазы());
	Если РабочееСоединение = ТекущееСоединение тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;   
КонецФункции

&НаСервере
Процедура ИТ_ЗагрузкаДокументовИз1С77() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаЗагрузкаДокументовИзСкладСГП.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ЗагрузитьДокументы();
КонецПроцедуры

&НаСервере
Процедура ИТ_ЗагрузкаИзУКМ() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаОбменаСУкм.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ЗагрузкаИзКасс();
КонецПроцедуры

&НаСервере
Процедура ИТ_ВыгрузкаВУКМ() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаОбменаСУкм.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ВыгрузкаВКассы();
КонецПроцедуры

&НаСервере
Процедура ИТ_ЗагрузкаИзУКМЧеков_OLD() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаОбменаСУкм.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ПрогрузкаЧеков();
КонецПроцедуры

&НаСервере
Процедура ИТ_ЗагрузкаИзУКМЧеков() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	РегЗадачиУКС = РегистрыСведений.ит_ЗадачиУКС.СоздатьМенеджерЗаписи();
	РегЗадачиУКС.НомерЗадачи = ПолучитьНовыйНомерЗадания();
	РегЗадачиУКС.ДатаЗадачи = ТекущаяДата();
	РегЗадачиУКС.ТекстЗадачи = "обрЗагрузкаЧеков = Справочники.ВнешниеПечатныеФормы.ПолучитьСсылку(Новый УникальныйИдентификатор(""a1a75d16-9b4d-11ea-813c-005056bc3a88""));
	|ТекОбработкаЗагрузкаЧеков = ИТ_РегламентныеПроцедуры.ПолучитьВнешнююОбработку(обрЗагрузкаЧеков.Получитьобъект());
	|ТекОбработкаЗагрузкаЧеков.АвтоЗагрузкаЧеков = Истина;
	|ТекОбработкаЗагрузкаЧеков.АвтозагрузкаЧеков();";
	
	РегЗадачиУКС.Комментарий = "Зарузка чеков";
	РегЗадачиУКС.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерЗадания() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕстьNull(МАКСИМУМ(ит_ЗадачиУКС.НомерЗадачи),1) + 1 КАК НомерЗадачи
	|ИЗ
	|	РегистрСведений.ит_ЗадачиУКС КАК ит_ЗадачиУКС");
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаЗапроса.Следующий() Тогда
		Возврат ВыборкаЗапроса.НомерЗадачи; 
	Иначе
		Возврат 1;
	КонецЕсли; 
КонецФункции	

&НаСервере
Функция ПолучитьВнешнююОбработку(ОбъектОбработки) Экспорт
	// получаем обработку
	ОбработкаЕсть=Ложь;
	Расширение = "epf";
	Если ТипЗнч(ОбъектОбработки)=Тип("СправочникОбъект.ДополнительныеОтчетыИОбработки") Тогда
		Адрес=ПоместитьВоВременноеХранилище(ОбъектОбработки.ХранилищеОбработки.Получить(),Новый УникальныйИдентификатор());
		
		ЗащитаотОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
		ЗащитаотОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		ПутьВнешняяОбработка = ВнешниеОбработки.Подключить(Адрес,, Ложь,ЗащитаотОпасныхДействий);
		Возврат ВнешниеОбработки.Создать(ПутьВнешняяОбработка, Ложь, ЗащитаотОпасныхДействий);

	Иначе
		Если ОбъектОбработки.ХранитьВоВнешнемФайле Тогда
			ИмяФайла=ОбъектОбработки.ПутьКВнешнемуФайлу;
			ВременныйФайл=Новый Файл(ИмяФайла);
			Если ВременныйФайл.Существует() Тогда
				ОбработкаЕсть=Истина;
			КонецЕсли;
			ВременныйФайл=Неопределено;
		Иначе
			
			Если ОбъектОбработки.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Обработка Тогда
				Расширение = "epf";
			ИначеЕсли ОбъектОбработки.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Отчет Тогда
				Расширение = "erf";
			ИначеЕсли ОбъектОбработки.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Таблица Тогда
				Расширение = "mxl";
			ИначеЕсли ОбъектОбработки.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Текст Тогда
				Расширение = "txt";
			ИначеЕсли ОбъектОбработки.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.ДокументXML Тогда
				Расширение = "xml";
			Иначе
			КонецЕсли;
			
			//ИмяФайла=ПолучитьИмяВременногоФайла("epf");
			ИмяФайла=ПолучитьИмяВременногоФайла(Расширение);
			
			//Адрес=ПоместитьВоВременноеХранилище(ОбъектОбработки.Хранилище.Получить(),Новый УникальныйИдентификатор());
			
			//ЗащитаотОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
			//ЗащитаотОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
			//Возврат ВнешниеОбработки.Подключить(Адрес,, Ложь,ЗащитаотОпасныхДействий);
			ОбработкаЕсть=ВыгрузитьВнешнююПечатнуюФорму(ИмяФайла,ОбъектОбработки);
		КонецЕсли;
	
		// если удалось получить обработку, то заполняем
		Если ОбработкаЕсть Тогда
			ВнешняяОбработка = Неопределено;
			Если Расширение = "epf" Тогда
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла,Ложь);
			Иначе
				ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайла,Ложь);
			КонецЕсли;
			//Исключение
			//	Попытка 
			//		ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайла,Ложь);
			//	Исключение
			//	КонецПопытки;
			//КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВнешняяОбработка;
КонецФункции


Функция ВыгрузитьВнешнююПечатнуюФорму(ПутьКФорме=Неопределено,ОбъектОбработки) Экспорт 
	Если Не ПроверкаНаличияВнешнегоОтчета(,ОбъектОбработки) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФорме) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ОбъектОбработки.ХранитьВоВнешнемФайле Тогда
		ПечатнаяФорма=ОбъектОбработки.Хранилище.Получить();
		//Если ПечатнаяФорма=Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
			Возврат Ложь;
		КонецЕсли;
		ПечатнаяФорма.Записать(ПутьКФорме);
		Возврат Истина;
	Иначе
		КопироватьФайл(ОбъектОбработки.ПутьКВнешнемуФайлу,ПутьКФорме);
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПроверкаНаличияВнешнегоОтчета(ПутьПроверки="",ОбъектОбработки) Экспорт
	Если ОбъектОбработки.ХранитьВоВнешнемФайле Тогда
		// проверим, а есть ли файл?
		ФайлМакета=Новый Файл(ОбъектОбработки.ПутьКВнешнемуФайлу);
		Возврат ЗначениеЗаполнено(?(ПутьПроверки="",ОбъектОбработки.ПутьКВнешнемуФайлу,ПутьПроверки)) И ФайлМакета.Существует();
	Иначе
		Возврат Не ОбъектОбработки.Хранилище.Получить()=Неопределено;
	КонецЕсли;
КонецФункции	

&НаСервере
Процедура ИТ_ВыгрузкаВMySQL() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаВыгрузкаВMySQL.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ВыгрузитьДисконтныеКарты();
КонецПроцедуры

&НаСервере
Процедура ИТ_НочноеПерепроведениеДокументов() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаНочногоПерепроведенияДокументов.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.Перепровести();
КонецПроцедуры

&НаСервере
Процедура ИТ_ПроставлениеОплаченВПлатежныхПоручениях() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.НастройкиОПроставленииОплаченныхПлатежек.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.Загрузка();
КонецПроцедуры

&НаСервере
Процедура ИТ_ЗагрузкаЗаявокИзСГППодключением() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ЗагрузкаЗаявокИзСГППодключением.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ЗагрузитьДокументы();
КонецПроцедуры

&НаСервере
Процедура ИТ_ОтправкаОтчетаПоПФ() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОтправкаОтчетаПоПФ.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ВыполнитьОбработку();
КонецПроцедуры

&НаСервере
Процедура ИТ_ОтправкаОтчетаПоПродажам() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОтправкаОтчетовПоПродажам.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ВыполнитьОбработку();
КонецПроцедуры//Цепелев  --- 2018-12-06              

&НаСервере
Процедура ВыгрузкаПолуфабрикатовВСГП() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаВыгрузкиПолуфабрикатовВСГП.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ВыгрузитьДокументы();
КонецПроцедуры

&НаСервере
Процедура СоздавалкаПеремещений() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбработкаСоздавалкаПеремещений.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.СоздатьДокументы();
КонецПроцедуры

&НаСервере
Процедура ит_ОтправкаПревышенияОстаткаВДенежномЯщике() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОтправкаПревышенияОстаткаВДенежномЯщике.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ОтправкаИнформацииПоПревышениюОстаткаВДЯ();
КонецПроцедуры

&НаСервере
Процедура ит_ОбновитьЗапретПродажиПоОстаткам() Экспорт
	Если НЕ РабочаяБаза() тогда 
		Возврат;
	КонецЕсли;
	
	ПутьОбработки = Справочники.ИТ_НастройкиДописанногоФункционала.ОбрботкаОбновитьЗапретПродажиПоОстаткам.Значение;
	ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьОбработки,ложь);
	ВнешняяОбработка.ОбновитьЗапретПродажиПоОстаткам();
КонецПроцедуры

&НаСервере
Процедура ит_УстановитьДатуЗапретаРедактирования() Экспорт
	НоваяДатаЗапрета = НачалоМесяца(ТекущаяДата()) - 1;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СкладыКомпании.Ссылка
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|ГДЕ
	|	НЕ СкладыКомпании.ЭтоГруппа");
	
	РезЗапрос = Запрос.Выполнить();
	
	Выборка = РезЗапрос.Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.ДатаЗапретаРедактирования = НоваяДатаЗапрета;
		Об.Записать();
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ит_ЗагрузкаШтрихкодовИзЕРП() Экспорт
	ОбработкаОбъект = Обработки.ит_ОбменЕРП_ШтрихкодыНоменклатуры.Создать();
	ОбработкаОбъект.ЗагрузитьШтрихкодыИзЕРП();
КонецПроцедуры

&НаСервере
Процедура ИТ_ОбновлениеСтавокНДС(ДатаСтавокНДС = Неопределено) Экспорт
	
	Если Не(ЗначениеЗаполнено(ДатаСтавокНДС)) Тогда 
		ДатаСтавокНДС = ТекущаяДата();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатураит_СтавкиНДС.Ссылка КАК ПозицияНоменклатуры,
		|	МАКСИМУМ(Номенклатураит_СтавкиНДС.ит_Дата) КАК Дата
		|ПОМЕСТИТЬ ДатыПоследнихСтавокНДС
		|ИЗ
		|	Справочник.Номенклатура.ит_СтавкиНДС КАК Номенклатураит_СтавкиНДС
		|ГДЕ
		|	НЕ Номенклатураит_СтавкиНДС.Ссылка.ПометкаУдаления
		|	И НЕ Номенклатураит_СтавкиНДС.Ссылка.ЭтоГруппа
		|	И Номенклатураит_СтавкиНДС.ит_Дата <= &ДатаСтавокНДС
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатураит_СтавкиНДС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатураит_СтавкиНДС.Ссылка КАК ПозицияНоменклатуры,
		|	Номенклатураит_СтавкиНДС.ит_СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ СрезПоследнихСтавокНДС
		|ИЗ
		|	ДатыПоследнихСтавокНДС КАК ДатыПоследнихСтавокНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ит_СтавкиНДС КАК Номенклатураит_СтавкиНДС
		|		ПО ДатыПоследнихСтавокНДС.ПозицияНоменклатуры = Номенклатураит_СтавкиНДС.Ссылка
		|			И ДатыПоследнихСтавокНДС.Дата = Номенклатураит_СтавкиНДС.ит_Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДатыПоследнихСтавокНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезПоследнихСтавокНДС.ПозицияНоменклатуры,
		|	СрезПоследнихСтавокНДС.СтавкаНДС
		|ИЗ
		|	СрезПоследнихСтавокНДС КАК СрезПоследнихСтавокНДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО СрезПоследнихСтавокНДС.ПозицияНоменклатуры = Номенклатура.Ссылка
		|			И СрезПоследнихСтавокНДС.СтавкаНДС <> Номенклатура.СтавкаНДС
		|			И (СрезПоследнихСтавокНДС.СтавкаНДС <> ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ДатаСтавокНДС", ДатаСтавокНДС);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ПозицияНоменклатуры	= Выборка.ПозицияНоменклатуры;
		НоменклатураОбъект	= ПозицияНоменклатуры.ПолучитьОбъект();
		
		НоменклатураОбъект.СтавкаНДС				= Выборка.СтавкаНДС;
		НоменклатураОбъект.ОбменДанными.Загрузка	= Истина;
		
		// Переписать на логирование, с уровнем "Ошибка" после доработки логирования на отправку писем.
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				"Обновление ставок НДС (ИТ)",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Номенклатура,
				ПозицияНоменклатуры,
				ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры

//++ Попов Л.Г., 2025-12-29, Интеграция с Общепит
&НаСервере
Процедура ит_ВыгрузкаЗакрытиеСменВОбщепит() Экспорт
	Обработка = Обработки.ит_ВыгрузкаЗакрытиеСменВОбщепит.Создать();
	Обработка.ВыполнитьМетод();
КонецПроцедуры
//-- Попов Л.Г., 2025-12-29
